#ifndef __LED_H
#define __LED_H

#include "sys.h"

#define LED1 PBout(3)
#define LED2 PAout(8)

void LED_Init(void);

#endif

/*逻辑与&&
// 0 && 0 = 0
// 0 && 1 = 0
// 1 && 0 = 0
// 1 && 1 = 1
// 逻辑或||
// 0 || 0 = 0
// 0 || 1 = 1
// 1 || 0 = 1
// 1 || 1 = 1
// 逻辑！
// !0 = 1
// !1 = 0
// 逻辑&&和逻辑||是短路逻辑运算符，即如果第一个操作数已经能够确定整个表达式的值，则不会再计算第二个操作数。
// 逻辑&&和逻辑||的优先级相同，高于逻辑！。
// 逻辑！是单目运算符，只需要一个操作数，用于对操作数进行逻辑取反。

//按位与&
// 0 & 0 = 0
// 0 & 1 = 0
// 1 & 0 = 0
// 1 & 1 = 1
// 按位或|
// 0 | 0 = 0
// 0 | 1 = 1
// 1 | 0 = 1
// 1 | 1 = 1
// 按位异或^
// 0 ^ 0 = 0
// 0 ^ 1 = 1
// 1 ^ 0 = 1
// 1 ^ 1 = 0
// 按位取反~
// ~0 = 1
// ~1 = 0
// 按位左移<<
// 1 << 1 = 10
// 1 << 2 = 100
// 1 << 3 = 1000
// 按位右移>>
// 1000 >> 1 = 100
// 1000 >> 2 = 10
// 1000 >> 3 = 1
// 按位与&、按位或|、按位异或^、按位取反~、按位左移<<、按位右移>>的优先级相同，低于算术运算符，高于逻辑运算符。

// uint8_t：表示无符号8位整数，取值范围是0到255。
// uint16_t：表示无符号16位整数，取值范围是0到65535。
// uint32_t：表示无符号32位整数，取值范围是0到4294967295。

// int8_t：表示有符号8位整数，取值范围是-128到127。
// int16_t：表示有符号16位整数，取值范围是-32768到32767。
// int32_t：表示有符号32位整数，取值范围是-2147483648到2147483647。

//int：表示有符号整数，取值范围是-2147483648到2147483647。
// float：表示单精度浮点数，取值范围是-3.40282347E+38到3.40282347E+38。
// double：表示双精度浮点数，取值范围是-1.7976931348623158E+308到1.7976931348623158E+308。
// char：表示字符类型，取值范围是-128到127。

// bool：表示布尔类型，取值范围是true或false。
// size_t：表示无符号整数，取值范围是0到SIZE_MAX。
// wchar_t：表示宽字符类型，取值范围是0到65535。
// intptr_t：表示指针类型，取值范围是INTPTR_MIN到INTPTR_MAX。
// uintptr_t：表示无符号指针类型，取值范围是0到UINTPTR_MAX。
// intmax_t：表示最大整数类型，取值范围是INTMAX_MIN到INTMAX_MAX。
// uintmax_t：表示最大无符号整数类型，取值范围是0到UINTMAX_MAX。
// long long：表示长整型，取值范围是-9223372036854775808到9223372036854775807。
// unsigned long long：表示无符号长整型，取值范围是0到18446744073709551615。
// __int64：表示64位整数，取值范围是-9223372036854775808到9223372036854775807。
// __int64：表示无符号64位整数，取值范围是0到18446744073709551615。
*/
